{
  "00e46c015f972018": "Array containing list of uninstalled applications.",
  "00e84a14b1a4ebbb": "Client Server",
  "0119d90faa247aa4": "Listeners receive callbacks when interesting things occur.",
  "014290ced4abbc16": "Update configuration in the database instead of in local configuration.",
  "0146637b5690e538": "Column/Key",
  "01b2e13feda9fa39": "Customize the logo and wordmark text in the header.",
  "01be2e8971587efb": "Configuring File Storage",
  "02e8104f1f15520d": "%s / %s",
  "02ee1af29809657f": "Address ranges of cluster hosts.",
  "03a68b7d8b854f2e": "Memory Usage",
  "0424383c2ac940f6": "Impersonating users over the API is no longer supported.",
  "0424f6e7026fa4bc": "Table",
  "0498c432c0c7a1dc": "Ignore Setup Issue",
  "04a2520895d8cf31": "This option allows you to enable DarkConsole on every page, even for logged-out users. This is only really useful if you need to debug something on a logged-out page. You should not enable this option in production.\n\nYou must enable DarkConsole by setting '%s' before this option will have any effect.",
  "04cbf12d6b26c3dc": "You likely enabled search.elastic.host without creating the index. Run `./bin/search init` to correct the index.",
  "04e9462c0ff02bb9": "Modules",
  "053d9b0bab24cf4b": "Repository %s has unreplicated changes (for %s).",
  "056efce83f4d6e34": "Phabricator now automatically discovers available storage engines at runtime.",
  "058467e123d12c53": "The controller or workflow which handled the request.",
  "05aef5cd275571c8": "Applications application",
  "062c448e3695855c": "The namespace that Phabricator databases should use.",
  "06bfdce28df01fa0": "%s created this configuration entry.",
  "0727f7dd81bcb0ea": "You have enabled pygments and the %s script is available, but does not seem to work.",
  "079dc290327b71e2": "This column is missing a type specification.",
  "07e771bf7da95ab2": "Configure the Phabricator UI, including colors.",
  "0870bcd2dd0c4abc": "Adapter class to use to transmit SMS to an external provider. A given external provider will most likely need more configuration which will most likely require registration and payment for the service.",
  "0898a760c633b197": "Column Has No Specification",
  "08a6d7657f0286b6": "Delete configuration in the database instead of in local configuration.",
  "08d550a8f0afc436": "No Email Preferences Link",
  "0913da7b1bd0ca6c": "Default \"from\" number.",
  "0a1b320faf85ceb6": "Configure Phabricator to run on a cluster of hosts.",
  "0a5450ca0e540323": "Configure mailer used by PHPMailer.",
  "0a68701b9759849c": "Repository %s has unreplicated changes.",
  "0af58e94652b9526": "MySQL %s Mode Set",
  "0b11ced577df07e2": "If the web server responds to both HTTP and HTTPS requests but you want users to connect with only HTTPS, you can set this to `true` to make Phabricator redirect HTTP requests to HTTPS.\n\nNormally, you should just configure your server not to accept HTTP traffic, but this setting may be useful if you originally used HTTP and have now switched to HTTPS but don't want to break old links, or if your webserver sits behind a load balancer which terminates HTTPS connections and you can not reasonably configure more granular behavior there.\n\nIMPORTANT: Phabricator determines if a request is HTTPS or not by examining the PHP `%s` variable. If you run Apache/mod_php this will probably be set correctly for you automatically, but if you run Phabricator as CGI/FCGI (e.g., through nginx or lighttpd), you need to configure your web server so that it passes the value correctly based on the connection type.\n\nIf you configure Phabricator in cluster mode, note that this setting is ignored by intracluster requests.",
  "0b705ec96296f7ea": "This version of Mercurial returns a bad exit code after a successful pull.",
  "0b87fb4e6f23c6f5": "The '%s' binary on this system has unexpected behavior: it was expected to exit without an error code when passed identical files, but exited with code %d.",
  "0b8e953c1065714c": "No active repositories have outstanding errors.",
  "0b907ae49e1edb37": "Option '%s' must be a list of strings, but the value is a map with unnatural keys.",
  "0bb18642b70b9f8a": "Usage",
  "0c214f1d184be6b9": "Move port information from `%s` to `%s` in your config.",
  "0cca03a66ade8d95": "Deprecated Maniphest Field Policies",
  "0cfa41f9d45b672e": "This option can not be edited from the web UI. Use %s to adjust garbage collector policies.",
  "0d0e37c45b7cd60e": "Set a local configuration value.",
  "0d3e7aa802a7545a": "Large file storage has not been configured, which will limit the maximum size of file uploads. See %s for instructions on configuring uploads and storage.",
  "0da81f052ad46d4f": "%s deleted %s (again?).",
  "0dac4143d9108818": "Access log format.",
  "0e06f013aed53511": "Specify a value to set the key '%s' to.",
  "0e764dfbb521ca54": "Access log location.",
  "0ecba44c7f542583": "Phabricator occasionally shells out to other binaries on the server. An example of this is the `%s` command, used to syntax-highlight code written in languages other than PHP. By default, it is assumed that these binaries are in the %s of the user running Phabricator (normally 'apache', 'httpd', or 'nobody'). Here you can add extra directories to the %s environment variable, for when these binaries are in non-standard locations.\n\nNote that you can also put binaries in `%s` (for example, by symlinking them).\n\nThe current value of PATH after configuration is applied is:\n\n  lang=text\n  %s",
  "0f5cd6c33a04f33b": "Phabricator no longer shows reply hints in mail.",
  "0feb9ad2f8369fae": "Phabricator is not configured in cluster mode.",
  "0ff69342bb44a283": "Large File Storage Not Configured",
  "1075f7912a835668": "Migrating file-based config to more modern config...",
  "114d7cd053477909": "SendGrid API username.",
  "114e099ead76ba2d": "Run the storage upgrade script to setup databases (host \"%s\" has not been initialized).",
  "11c361d5e3cc4cbb": "Unrecognized verb: %s",
  "124eb784f5503ab2": "No REMOTE_ADDR is available, so Phabricator cannot determine the origin address for requests. This will prevent Phabricator from performing important security checks. This most often means you have a mistake in your preamble script. Consult the documentation (%s) and double-check that the script is written correctly.",
  "126706326fcb68f2": "Expected Collation",
  "1283564c622e4d41": "Controls whether Phabricator sends one email with multiple recipients in the \"To:\" line, or multiple emails, each with a single recipient in the \"To:\" line.",
  "148980d89ce033b5": "Use Normal HTTP Redirects",
  "148af44814a6b580": "Show Herald Hints",
  "148d75d526e7ffd3": "Configuration key '%s' is not set in %s configuration!",
  "149d974fe6995755": "Multi-Factor Optional",
  "15341bd9b871c84a": "Mail is configured to send via sendmail, but this system has no sendmail binary. Install sendmail or choose a different mail adapter.",
  "1647b9db6c01fdfd": "Access Denied",
  "16963a9a09a1c41a": "The configuration option '%s' has been removed. You may delete it at your convenience.\n\n%s",
  "1795aea6b4646b98": "Elasticsearch index exists but needs correction.",
  "1804c90829b7f01a": "Nullable",
  "180a7d63a161f78c": "The \"%s\" key is set to some value other than \"-1\" in your PHP configuration. This can cause PHP to raise deprecation warnings during process startup. Set this option to \"-1\" to prevent these warnings from appearing.",
  "18249d0a48aa107d": "No \"Host\" Header",
  "1972448e95292704": "Configure Mailgun integration.",
  "197fc28818497069": "The translation implementation has changed and providers are no longer used or supported.",
  "19a0b5dd52248a6b": "No SES From Address Configured",
  "19f7478b51c5b432": "The minimum supported version of Mercurial is 1.9, which was released in 2011.",
  "1a4c94bbbc38892e": "Format for the SSH access log. Use %s to set the path. Available variables are:",
  "1bf34d9a92d4a6e1": "PHP post_max_size Not Configured",
  "1c0deb83cc5383a7": "Can Not Connect to MySQL",
  "1c532fbf86d552d9": "Disable developer mode",
  "1d6cf6858db6243a": "Profile 0.1%% of all requests",
  "1dcb10ee4acacb23": "This option has been replaced with the more granular option `%s`.",
  "1dd776e5ac695938": "Require all users to configure multi-factor authentication.",
  "1eca90fcb77e7644": "Configuration Guide: Locked and Hidden Configuration",
  "1eddd86af9d27c8e": "This option enables verbose error reporting (stack traces, error callouts) and forces disk reads of static assets on every reload.",
  "1f35bf416fd15494": "(%s%s) %s",
  "1f72747a0fa76626": "Nonreplicating Replica",
  "1f83bc2e34055b3e": "Run these %d command(s):",
  "1faf96c4c8dcb226": "Config key '%s' is of type '%s'. Specify an integer.",
  "2012211e1cb72ba7": "Host for SMTP.",
  "2036e066463f85fd": "Your configuration fails to specify a server timezone. You can either set the PHP configuration value '%s' or the Phabricator configuration value '%s' to specify one.",
  "2039a2d4eb6dcdf5": "Unknown '%s' Version",
  "20e6382ca59e9ef2": "SES endpoint domain name. You can find a list of available regions and endpoints in the AWS documentation.",
  "20f2611e1506e05a": "You are using an old version of MySQL (on host \"%s\"), and should upgrade.",
  "21ab916405daaaf7": "Purge Caches",
  "224bb85614c1429b": "WARNING: This is a prototype option and the description below is currently pure fantasy.\n\nSwitch Phabricator to read-only mode. In this mode, users will be unable to write new data. Normally, the cluster degrades into this mode automatically when it detects that the database master is unreachable, but you can activate it manually in order to perform maintenance or test configuration.",
  "225f29589609a3a2": "Adjust %s in your PHP configuration to at least 32MB. When set to smaller value, large file uploads may not work properly.",
  "228b831b56854df1": "Show Recipient Hints",
  "22beeb23e44558cf": "Enable deflate compression",
  "234ee2c566bee926": "You can restrict allowed email addresses to certain domains (like `yourcompany.com`) by setting a list of allowed domains here.\n\nUsers will only be allowed to register using email addresses at one of the domains, and will only be able to add new email addresses for these domains. If you configure this, it implies {{auth.require-email-verification}}.\n\nYou should omit the `@` from domains. Note that the domain must match exactly. If you allow `yourcompany.com`, that permits `joe@yourcompany.com` but rejects `joe@mail.yourcompany.com`.",
  "2364ff5bb22650d1": "Option '%s' must be a set, but array contains values other than 'true'.",
  "239990e10965fa18": "Recaptcha private key, obtained by signing up for Recaptcha.",
  "23b034c2a920b93e": "MySQL InnoDB Engine Not Available",
  "24131f3e1ac0aa6b": "Proto",
  "241d0a71a958306d": "HTTP Strict Transport Security (HSTS) sends a header which instructs browsers that the site should only be accessed over HTTPS, never HTTP. This defuses an attack where an adversary gains access to your network, then proxies requests through an unsecured link.\n\nDo not enable this option if you serve (or plan to ever serve) unsecured content over plain HTTP. It is very difficult to undo this change once users' browsers have accepted the setting.",
  "247c7cf2604f80c2": "(No Value Configured)",
  "24b1b078ff3c5a16": "Config option '%s' is invalid. The URI must contain a dot ('%s'), like '%s', not just a bare name like '%s'. Some web browsers will not set cookies on domains with no TLD.",
  "24f2b54cf127a4a3": "Allow editing",
  "25316bd1e8e7dd95": "The HTTP method.",
  "2535ec8b1d1da3c6": "The webserver's host name.",
  "253d034b11d83a56": "PHP Timezone Invalid",
  "2564b3786e7d5c77": "Minify static resources by removing whitespace and comments. You should enable this in production, but disable it in development.",
  "26108f5a27e0c1da": "Phabricator Configuration",
  "263e91af9258cf88": "Integration with Recaptcha",
  "2665215d93a14958": "Global cap for size of generated emails (bytes).",
  "270fc142ac592c5e": "Access Logs",
  "272913189b938226": "This server has a known bad version of \"%s\" installed (\"%s\"). This version is not supported, or contains important bugs or security vulnerabilities which are fixed in a newer version.",
  "2740cf33680ec4df": "Allow non-members to interact with tasks over email.",
  "27418ddfaa3f5322": "Database host \"%s\" does not support the %s option. You will not be able to find search results for common words. You can gain access to this option by upgrading MySQL to a more recent version.\n\nYou can ignore this warning if you plan to configure ElasticSearch later, or aren't concerned about searching for common words.",
  "2760308a0f6d1684": "Character Set",
  "276ee01372b62de2": "Phabricator puts databases in a namespace, which defaults to 'phabricator' -- for instance, the Differential database is named 'phabricator_differential' by default. You can change this namespace if you want. Normally, you should not do this unless you are developing Phabricator and using namespaces to separate multiple sandbox datasets.",
  "2804d9f16a38553f": "Formats",
  "2827bc0c2fd7cffd": "Ambiguous Leader",
  "28752308e85e8ddb": "Amazon SES does not support sending email as users. Disable send as user, or choose a different mail adapter.",
  "2886127cc1127287": "Config key \"%s\" is locked and can only be set in local configuration. To learn more, see \"%s\" in the documentation.",
  "28a2495ff0c80e46": "This option can help debug pages which are taking a very long time (more than 30 seconds) to render.\n\nIf a page is slow to render (but taking less than 30 seconds), the best tools to use to figure out why it is slow are usually the DarkConsole service call profiler and XHProf.\n\nHowever, if a request takes a very long time to return, some components (like Apache, nginx, or PHP itself) may abort the request before it finishes. This can prevent you from using profiling tools to understand page performance in detail.\n\nIn these cases, you can use this option to force the page to abort after a smaller number of seconds (for example, 10), and dump a useful stack trace. This can provide useful information about why a page is hanging.\n\nTo use this option, set it to a small number (like 10), and reload a hanging page. The page should exit after 10 seconds and give you a stack trace.\n\nYou should turn this option off (set it to 0) when you are done with it. Leaving it on creates a small amount of overhead for all requests, even if they do not hit the time limit.",
  "28c73b5566d2027f": "Config option '%s' is invalid. The timezone identifier must be a valid timezone identifier recognized by PHP, like '%s'. \n            You can find a list of valid identifiers here: %s",
  "28d0f448f7106684": "This option has been renamed to `%s` to emphasize the unfinished nature of many prototype applications. Your existing setting has been migrated.",
  "28e22fe3dde53ce0": "Clients",
  "291f0ed6874f0791": "Expected Columns",
  "294088750a7c7d4a": "Taskmasters now use an autoscaling pool. You can configure the pool size with `%s`.",
  "295deb9ee5cdd9b4": "This configuration is locked and can not be edited from the web interface. Use %s in %s to edit it.",
  "295ea07340442489": "Multiple %s subclasses contain an option named '%s'!",
  "298e0c15a0adb141": "Pygments should be installed and enabled to provide advanced syntax highlighting.",
  "2ad965e7357d3c05": "Recaptcha public key, obtained by signing up for Recaptcha.",
  "2aef4eb2f4ce4e3c": "Database Servers",
  "2b41bfb7de9a0474": "Specify a configuration key to delete.",
  "2b8e49846ff2e912": "This web host (\"%s\") is set to a very different time than a database host \"%s\".",
  "2bbdbea834a4f49f": "Send Mail To Each Recipient",
  "2c5c5c099fdbc46d": "Remove Custom Logo",
  "2c7e23ee7e2ea298": "No notification servers are configured.",
  "2c9888802437d506": "(Not Supported)",
  "2ca72c0eb47450fd": "Nonstandard port",
  "2d0758456f316ff8": "This configuration has been removed. You can safely delete it.\n\n%s",
  "2d0a6dd511df12fa": "Options relating to translations.",
  "2d1579e046c58211": "You have '%s' enabled in your PHP configuration, but Phabricator will not run in safe mode. Safe mode has been deprecated in PHP 5.3 and removed in PHP 5.4.\n\nDisable safe mode to continue.",
  "2dcd435eeebf652c": "Use Private Replies (More Secure)",
  "2df8a486f09da291": "Option '%s' must be a list of regular expressions, but the value '%s' is not a valid regular expression.",
  "2e14abfc2c0d6b5f": "Treat all '*.x.bak' file as '.x'. NOTE: We map to capturing group 1 by specifying the mapping as '1'",
  "2eacbb8469fd852a": "Send as User Taking Action",
  "2ebe9995824505d0": "Security options.",
  "2f751bec79e76379": "Expected Unique",
  "2f7aab92baac9c1e": "Old MySQL Version",
  "2f81a9913ff38516": "If you have multiple Phabricator environments (like a development/staging environment for working on testing Phabricator, and a production environment for deploying it), set the production environment URI here so that emails and other durable URIs will always generate with links pointing at the production environment. If unset, defaults to `%s`. Most installs do not need to set this option.",
  "2f963a46ce9bc500": "Using PHPMailer with SMTP, you can set this to one of '%s' or '%s' to use TLS or SSL, respectively. Leave it blank for vanilla SMTP. If you're sending via Gmail, set it to '%s'.",
  "3098fdff61883a9a": "Configuring a Preamble Script",
  "30b53874aa78fd37": "Default Partition",
  "30bb5b6290a53b40": "Domain used for reply email addresses.",
  "31ad59c1a6781855": "Prevent editing",
  "31b39d8cfe22bd05": "Whitelist 1.2.3.*",
  "321f10310ed1322b": "This configuration is no longer relevant because daemons restart automatically on configuration changes.",
  "3232ad8546d7a96b": "The Differential revision list view age UI elements have been removed to simplify the interface.",
  "325bb3e6fb79eb13": "Class does not exist.",
  "32beb5b9df2be535": "Separate values with newlines.",
  "3324e0bffe4d35b8": "Exception Handlers",
  "337b713a5d8f0760": "PHP 7 Not Supported",
  "33b0fb16a6f9d821": "This schema has the wrong nullable setting.",
  "3404e98d340a33d8": "Config option '%s' is invalid. The URI must start with '%s' or '%s'.",
  "343890ebae9dc18b": "Unsupported/Insecure \"%s\" Version",
  "345f49a96f02c2ba": "SES Can't Send As User",
  "34ab06cb81d1a4f4": "Authorization token from Twilio service.",
  "34d45b0b30ef89f7": "This option does not have a custom type!",
  "34d8dedef4bd00ec": "Require administrators to approve new accounts.",
  "3703cd216881d330": "Health",
  "376a4e86890de4e0": "Control how mail is sent.",
  "3772602fd6877c78": "System user to run daemons as.",
  "37986172c4f1b3bb": "Unknown schema status \"%s\"!",
  "379a4c12cb96bb83": "MySQL May Run Slowly",
  "37dddc9e77839277": "Phabricator now manages typeahead strategies automatically.",
  "37f119ae3bb81ce7": "Too many arguments: expected one key.",
  "387201e0e2bf24d5": "No \"Host\" header present in request.",
  "39b21bbf479712ca": "Edit \"%s\"",
  "3a3d00a1343b1649": "Don't embed YouTube videos",
  "3a68c6cf6e1f0d7b": "Disable PHP %s",
  "3a8ad017d085ff52": "Configure master encryption keys.",
  "3adecc79d0ee8efd": "Amazon SES Secret Key Not Set",
  "3b4dfd34cdc7bacd": "Phabricator now has meaningful global access controls. See `%s`.",
  "3b57019f99f57afe": "If you're using PHPMailer to send email, provide the mailer and options here. PHPMailer is much more enormous than PHPMailerLite, and provides more mailers and greater enormity. You need it when you want to use SMTP instead of sendmail as the mailer.",
  "3b7069ea27b7c64f": "Database replica \"%s\" is listed as a replica, but is not currently replicating. You are vulnerable to data loss if the master fails.",
  "3b7e25cbe7e16d36": "Garbage Collectors",
  "3c7750d84945f3ff": "%s edited this configuration entry.",
  "3cdc74c88ecf28f8": "Enable Phabricator's debugging console.",
  "3d01fc462117dced": "Send Mail To All Recipients",
  "3e3ca7fba12b0eac": "Launch daemons in 'trace' mode by default.",
  "3e46b76b2d44872e": "Your install has no current setup issues to resolve.",
  "3eb17bd453f493b4": "Allow Insecure Reply-To Auth",
  "3ef041b740c39ec3": "Subschemata Have Failures",
  "3f07bef525f59607": "This request included an invalid \"Host\" header, with value \"%s\". Host headers must contain a dot (\".\"), like \"example.com\". This is required for some browsers to be able to set cookies.\n\nThis may mean the base URI is configured incorrectly. You must serve Phabricator from a base URI with a dot (like \"https://phabricator.mycompany.com\"), not a bare domain (like \"https://phabricator/\"). If you are trying to use a bare domain, change your configuration to use a full domain with a dot in it instead.\n\nThis might also mean that your webserver (or some other network device, like a load balancer) is mangling the \"Host\" header, or you are using a tool or library to issue a request manually and setting the wrong \"Host\" header.\n\nRequests must include a valid \"Host\" header.",
  "3f1929cb9429c55f": "Save Config Entry",
  "3fd293a9d6152d26": "%s of %s",
  "4009bea6fea89230": "Setup MySQL Schema",
  "400f08b84d5e87d7": " (%s)",
  "407eafd2fdca583e": "Trust \"Reply-To\" headers for authentication.",
  "408d9916fd5927c9": "This option has been removed, you can use Dashboards to provide homepage customization. See T11533 for more details.",
  "40a42d922391db6e": "Data Cache",
  "40a615c67b76e1b6": "Configure the access logs, which log HTTP/SSH requests.",
  "40e3403c0c066d69": "%ss Behind",
  "4119007a51fb8a7f": "The PID of the server process.",
  "41e68d6902c1a427": "Launch daemons in 'verbose' mode by default. This creates a lot of output, but can help debug issues. Daemons launched in debug mode with '%s' are always launched in verbose mode. See also '%s'.",
  "41ea645aaecc2a86": "Blacklist subnets to prevent user-initiated outbound requests.",
  "423ac632bebf0560": "No Outbound Requests",
  "423e87fbd63d59dd": "No Sendmail Binary Found",
  "42802c2c109bc2e2": "Primary install URI, for multi-environment installs.",
  "43190b4c00330069": "Whitelists editor protocols for \"Open in Editor\".",
  "43376f6280445187": "The \"Re: Prefix\" and \"Vary Subjects\" settings are now configured in global settings.",
  "43a9ab980b27e875": "You have no unresolved setup issues.",
  "43dc083a451b8fc3": "This configuration is hidden and can not be edited or viewed from the web interface.",
  "43dcc3307191505e": "Local Disk Storage Not Readable/Writable",
  "442caabf3a81cb8a": "Override translations.",
  "4443e2976c8151ca": "Cluster Configuration Out of Sync",
  "448b4c09ab72a52d": "This option has been removed. You may delete it at your convenience.",
  "44e87cfd1fcbd6a5": "Unknown Configuration Option \"%s\"",
  "4506a449f8634b62": "Truncate at 1MB",
  "4533fcabc9e099a7": "Access key for Amazon S3.",
  "4584668461c10ef7": "The PATH component '%s' (which resolves as the absolute path '%s') is not usable because '%s' is not readable.",
  "45b2d872b3c7c149": "Maniphest fields are now loaded automatically. You can configure them with `%s`.",
  "45f3f4847f082327": "This key is expected to exist, but does not.",
  "465a97a1d0660f7a": "Disable deflate compression",
  "46f754bc21c0be2b": "Normal mode",
  "47bae244d4972d0b": "Amazon SES is selected as the mail adapter, but no SES secret key is configured. Provide an SES secret key, or choose a different mail adapter.",
  "47f8dbf7d35406e5": "This schema is expected to exist, but does not.",
  "48183d942f9fd2d7": "Do Not Use Pygments",
  "482e9bd3f6e7a8d5": "Up to Date",
  "48afc8e308475f22": "Configure core options, including URIs.",
  "48b2f0579d650e42": "(empty)",
  "48db42b3a004c841": "This key has the wrong uniqueness setting.",
  "48e7249ad3069fe0": "When users set or reset a password, it must have at least this many characters.",
  "497e0b3a674b70d3": "Additional configuration options to lock.",
  "4a0cfd16a364b1e4": "Override what language files (based on filename) highlight as.",
  "4a2be2efe91989af": "Bad \"Host\" Header",
  "4ac27365f2bfdc9e": "Option '%s' is of type bool, but value is not true or false.",
  "4b4bbd2eb0188b6d": "MySQL port to use when connecting to the database.",
  "4b564ef4bc1718b0": "Configuration Locked",
  "4b73efb9b028c2aa": "URI where Phabricator is installed.",
  "4b804f5e72d307ae": "Trying to add duplicate key \"%s\"!",
  "4be15481daaf273e": "User Guide: Amazon RDS",
  "4c8c25b6a6596689": "Repository %s has an ambiguous leader.",
  "4ee271969119b0a5": "Configuration of the notification server has changed substantially. For discussion, see T10794.",
  "4f45f90c0647ba4e": "Database source is not configured properly",
  "4f9cf442678261c3": "Don't Require Manual Approval",
  "4fe31833216c7358": "Column Type",
  "4fe6e0b3cf30f81e": "Truncate at 512KB",
  "502e4b883da7839b": "Should Phabricator use Pygments to highlight code?",
  "50338b3b242845e2": "Cache",
  "50d9105a8a307db1": "Automatically profile some percentage of pages.",
  "5103a1ba5b83372e": "Admin Server",
  "510624ee93ad2194": "Wrong Column Type",
  "5191e7bee5b1b75f": "Database host \"%s\" is configured to use the default minimum word length when building search indexes, which is 4. This means words which are only 3 characters long will not be indexed and can not be searched for.\n\nFor example, you will not be able to find search results for words like 'SMS', 'web', or 'DOS'.\n\nYou can change this setting to 3 to allow these words to be indexed. Alternatively, you can ignore this warning if you are not concerned about searching for 3-letter words. If you later plan to configure ElasticSearch, you can also ignore this warning: only MySQL fulltext search is affected.\n\nTo reduce the minimum word length to 3, add this to your %s file (in the %s section) and then restart %s:\n\n%s\nFinally, run this command to rebuild indexes using the new rules:\n\n%s",
  "51b491c5b83d06d5": "Embed YouTube videos",
  "51bc52c2a4f14f77": "Add One Path",
  "522175083f0bf50b": "Clear Cache",
  "529480a3ec48c5bb": "Unignore this setup issue?",
  "52a9d06229e19e34": "Configure Mail.",
  "52dc66acd6274e74": "Determines which URI protocols are auto-linked.",
  "531800d5b47fd8dc": "You can update these %d value(s) here:",
  "534e2f855629f6c5": "Notification Servers",
  "5378e62acc827b89": "This is hashed with other inputs to generate mail tokens. If you want, you can change it to some other string which is unique to your install. In particular, you will want to do this if you accidentally send a bunch of mail somewhere you shouldn't have, to invalidate all old reply-to addresses.",
  "53cb13052e7b336a": "extname",
  "546bf01e35ee8e5e": "Enable captchas with Recaptcha.",
  "54de76ae6273d4db": "Add Multiple Paths",
  "553639fd7f506470": "Option '%s' is of type string, but value is not a string.",
  "553921b5c4dc5592": "The environmental variable %s is empty. Phabricator needs to execute some system commands, like `%s`, `%s`, `%s`, and `%s`. To execute these commands, the binaries must be available in the webserver's %s. You can set additional paths in Phabricator configuration.",
  "559d8033c9293bf0": "Option '%s' value must name a class extending '%s'.",
  "5693f19a12713a26": "Set the URI where Phabricator is installed. Setting this improves security by preventing cookies from being set on other domains, and allows daemons to send emails with links that have the correct domain.",
  "569d25c956a6df9a": "Define a Phabricator cluster by providing a whitelist of host addresses that are part of the cluster.\n\nHosts on this whitelist have special powers. These hosts are permitted to bend security rules, and misconfiguring this list can make your install less secure. For more information, see **[[ %s | %s ]]**.\n\nDefine a list of CIDR blocks which whitelist all hosts in the cluster and no additional hosts. See the examples below for details.\n\nWhen cluster addresses are defined, Phabricator hosts will also reject requests to interfaces which are not whitelisted.",
  "56cef0a2c3e0fd69": "This server has a known bad version of \"%s\".",
  "573ee104c21027c7": "Require DarkConsole Activation",
  "57be8b8230c1681b": "Control how SMS is sent.",
  "57d1afa500778dd8": "Current Configuration",
  "58c95c094a4a459c": "Replicating Master",
  "595c76926a7c7f9b": "Without a configured timezone, PHP will emit warnings when working with dates, and dates and times may not display correctly.",
  "5999796d2639c177": "This schema can use a better character set.",
  "5a35baf96a1e5a8c": "Determines whether or not YouTube videos get embedded.",
  "5a39b8d96817ec46": "Allows you to add a footer with links in it to most pages. You might want to use these links to point at legal information or an about page.\n\nSpecify a list of dictionaries. Each dictionary describes a footer item. These keys are supported:\n\n  - `name` The name of the item.\n  - `href` Optionally, the link target of the item. You can     omit this if you just want a piece of text, like a copyright     notice.",
  "5a3b38f652ed8cd7": "The known issues with this old version are:",
  "5a77699e8640e420": "Not Enabled",
  "5b667f3f9ecebddb": "If you are using Amazon RDS, some of the instructions above may not apply to you. See %s for discussion of Amazon RDS.",
  "5ba9c3912362d6ec": "The notification server no longer requires root permissions. Start the server as the user you want it to run under.",
  "5c4f09fd1e8d019c": "This issue will no longer be suppressed, and will return to its rightful place as a global setup warning.",
  "5c66f37427cd7acc": "Allows you to remove levity and jokes from the UI.",
  "5cae88ddf5336e6a": "Sites",
  "5d5c9c967a7ad7ed": "T6185 \"Shellshock\" Bash Vulnerability",
  "5e1baf49edcb4323": "Missing '%s' Extension",
  "5e6af0e19a1343b1": "Retention policies for garbage collection.",
  "5e83a3eabf3edd8c": "MySQL (on host \"%s\") is configured with a very small innodb_buffer_pool_size, which may impact performance.",
  "5ecffe835dc27596": "You should upgrade this software.",
  "5edd2ba3b1bb7dab": "The following caches will be cleared:",
  "5f0e985b5476b24d": "Detected %s warning(s) with the schemata.",
  "5f36d603d0be36e2": "Deprecated mysql.host Format",
  "5f3c0faad1e0dc0e": "This key is on the wrong columns.",
  "5f402115040d0f3d": "Wrong Nullable Setting",
  "5f4af1a4a9b3fc41": "Secret key for Amazon S3.",
  "5fbd435aa745b440": "You are using an old version of MySQL (on host \"%s\") which has poor unicode support (it does not support the \"utf8mb4\" collation set). You will encounter limitations when working with some unicode data.\n\nWe strongly recommend you upgrade to MySQL 5.5 or newer.",
  "5ff9e9c5351538c0": "Trying to add duplicate column \"%s\"!",
  "5ffc4b34d12e9b79": "The Multimeter application collects performance samples. You can use this data to help you understand what Phabricator is spending time and resources doing, and to identify problematic access patterns.\n\nThis option controls how frequently sampling activates. Set it to some positive integer N to sample every 1 / N pages.\n\nFor most installs, the default value (1 sample per 1000 pages) should collect enough data to be useful without requiring much storage or meaningfully impacting performance. If you're investigating performance issues, you can adjust the rate in order to collect more data.",
  "608444cf93316163": "Minimum password length.",
  "60eb9b2e0c7fdbd9": "Required PHP extensions are not installed.",
  "61074f1c958d6cdd": "Database",
  "6129bbe7e5838dda": "UNHEALTHY: This database has failed recent health checks. Traffic will not be sent to it until it recovers.",
  "6142432ab832445b": "Request input, in bytes.",
  "622de911e873bcab": "You enabled pygments but the %s script is not actually available, your %s is probably broken.",
  "626dbef44ab40ac7": "Application Settings",
  "62a742ee265353cb": "Show email preferences link in email.",
  "62f6418101b51e87": "Alternative URIs that can access Phabricator.",
  "63075bbb3b8a6914": "After editing the PHP configuration, <strong>restart Phabricator for the changes to take effect</strong>. For help with restarting Phabricator, see %s in the documentation.",
  "63282f23d0e7b656": "Either the Phabricator schema for Elasticsearch has changed or Elasticsearch created the index automatically. Run `./bin/search init` to correct the index.",
  "63480bc81117d10f": "You can set a limit for the maximum byte size of outbound mail. Mail which is larger than this limit will be truncated before being sent. This can be useful if your MTA rejects mail which exceeds some limit (this is reasonably common). Specify a value in bytes.",
  "634a79070baf78f0": "Multiple %s subclasses have the same key ('%s'): %s, %s.",
  "63a3b3ed64b1ce8e": "Trying to add duplicate table \"%s\"!",
  "63a46b676917b188": "No Authentication Providers Configured",
  "63adbfc7dcdda9d1": "Run Silently",
  "63b9b9aadfed9fb2": "Secret key for Amazon SES.",
  "63d9d363ec7906dc": "You can find more information about PHP configuration values in the %s.",
  "63f2dc5bc41f0975": "Skipping option \"%s\"; already in local config.",
  "63f76be12cf6ae1f": "Cookies set for x.com are also sent for y.x.com. Assuming Phabricator instances are running on both domains, this will create a collision preventing you from logging in.",
  "6457187ab2e430fa": "Setup Issues",
  "646b78bcdb76fa1a": "Require email verification",
  "64afb90cf3f8b0fd": "%s Not Working",
  "64c7f279e0d92976": "You can use '%s' if you don't want to create a full translation to give users an option for switching to it and you just want to override some strings in the default translation.",
  "65001fe263b3ac8e": "If true, email addresses must be verified (by clicking a link in an email) before a user can login. By default, verification is optional unless {{auth.email-domains}} is nonempty.",
  "6512ee1541e9a6c5": "Connection",
  "657f228361b0e654": "SSH keys are now actually useful, so they are always enabled.",
  "65a93973ada5a6a7": "Request output, in bytes.",
  "65c92754ab74cf58": "Configure integration with AWS (EC2, SES, S3, etc).",
  "65d5b644919855aa": "Config option '%s' is invalid. The URI must contain a dot ('.'), like '%s', not just a bare name like '%s'. Some web browsers will not set cookies on domains with no TLD.",
  "66014c11c4c09702": "Database: %s",
  "665cda3eaee0fbc9": "Cache namespace.",
  "66999356dc475a67": "Custom remarkup rules are now added by subclassing %s or %s.",
  "66bed768185a2282": "The '%s' binary could not be found. Symlink it into '%s', or set the webserver's %s environmental variable to include the directory where it resides, or add that directory to '%s' in the Phabricator configuration.",
  "66befa8a4fb57dd5": "Issue Resolved",
  "66d7413435784835": "Integration with Mailgun",
  "677d155732845760": "Allow Phabricator to use a single mailbox for all replies.",
  "679990d186ebf0ab": "Garbage collectors are now configured with \"%s\".",
  "67d3d7d3251625aa": "Trying to add duplicate database \"%s\"!",
  "681cd222368609f7": "This column has the wrong autoincrement setting.",
  "681e6e1056b635bd": "Allows you to add footer links on most pages.",
  "684302d05a739f1c": "USWest Region",
  "68abec1d07b77a6c": "Maniphest fields are now defined in `%s`. Existing definitions have been migrated.",
  "699848c1b040c389": "Enable Prototypes",
  "6a02bdd01c0a0578": "Inbound mail addresses are now configured for each application in the Applications tool.",
  "6a5f8ead8596ff3c": "Partial '%s' Support",
  "6a8d52d2dc33a07c": "Subschemata have setup warnings.",
  "6aafa80cab6f4d80": "Uptime",
  "6ac56daf171cdb71": "Normally, Phabricator profiles pages only when explicitly requested via DarkConsole. However, it may be useful to profile some pages automatically.\n\nSet this option to a positive integer N to profile 1 / N pages automatically. For example, setting it to 1 will profile every page, while setting it to 1000 will profile 1 page per 1000 requests (i.e., 0.1%% of requests).\n\nSince profiling is slow and generates a lot of data, you should set this to 0 in production (to disable it) or to a large number (to collect a few samples, if you're interested in having some data to look at eventually). In development, it may be useful to set it to 1 in order to debug performance problems.\n\nNOTE: You must install XHProf for profiling to work.",
  "6ad215df88991706": "MySQL (on host \"%s\") is using a default stopword file, which will prevent searching for many common words.",
  "6b705c5226ea7080": "Two setup checks raised an issue with key '%s'!",
  "6ba2a0c32659704c": "Username for SMTP.",
  "6be70c7b9b5481fb": "Without '%s', Phabricator can not test for the availability of other binaries.",
  "6c0dd36cd3ffc093": "Skipping option \"%s\"; already in database config.",
  "6c504e01c242d367": "MySQL is in ONLY_FULL_GROUP_BY mode (on host \"%s\"), but using this mode is strongly discouraged.",
  "6cf859b6310ef2ca": "The directory for local repositories (%s) does not exist, or is not readable by the webserver. Phabricator uses this directory to store information about repositories. If this directory does not exist, create it:\n\n%s\nIf this directory exists, make it readable to the webserver. You can also edit the configuration below to use some other directory.",
  "6d3544c1f546ad69": "Database Status: %s.%s.%s",
  "6d392e64b1279ecf": "Customize the logo image and text which appears in the main site header:\n\n  - **Logo Image**: Upload a new 80 x 80px image to replace the Phabricator logo in the site header.\n\n  - **Wordmark**: Choose new text to display next to the logo. By default, the header displays //Phabricator//.\n\n",
  "6e0947b0060beb5d": "The Phabricator daemons are not running, so Phabricator will not be able to perform background processing (including sending email, rebuilding search indexes, importing commits, cleaning up old data, and running builds).\n\nUse %s to start daemons. See %s for more information.",
  "6e2a5116e26f8d9a": "The minimum supported version of Subversion is 1.5, which was released in 2008.",
  "6e2ad9018343c287": "Your PHP memory limit is configured in a way that may prevent you from uploading large files or handling large requests.",
  "6e2fab5eea81cb65": "The system user.",
  "6e41ee3f309a1d09": "Reload Page",
  "6e8d473db83cc50d": "Maximum number of taskmaster daemons to run at once. Raising this can increase the maximum throughput of the task queue. The pool will automatically scale down when unutilized.",
  "6f2116dd461af22a": "Phabricator now automatically selects the best available MySQL implementation.",
  "6f6b7e1133535f08": "Force users to connect via HTTPS instead of HTTP.",
  "6fd913e6c415844b": "Large Files",
  "70654d02c9db58f7": "%s Not Set",
  "70830bd82cf53333": "This configuration option has been replaced with a modular handler. See T9346.",
  "70e028b6ba941ed0": "Configuration option '%s' has invalid value and was restored to the default: %s",
  "70f1fc0bac4d77b2": "Don't minify static resources.",
  "715802f4292c6cd5": "To update these %d value(s), edit your PHP configuration file, located here:",
  "71fd2c3bde534f79": "Password for SMTP.",
  "71fdd7641faff64b": "Collation",
  "722a8bb542ea393f": "Replication",
  "724870e472a6e5fc": "The HTTP response code or process exit code.",
  "72fc21d8e3f6f2a4": "Obsolete; use standard rendering events instead.",
  "72feb47cbab9a2d8": "Local Disk Storage",
  "735e7dc2ba8fd620": "The configuration option '%s' is not recognized. It may be misspelled, or it might have existed in an older version of Phabricator. It has no effect, and should be corrected or deleted.",
  "73781a127ec1294a": "Issue",
  "737e7f526e8b8373": "Configuration Guide: Configuring a File Domain",
  "739ba48923d0e45c": "Activate DarkConsole on every page.",
  "740a7bf8cd6ce22c": "Enable verbose error reporting and disk reads.",
  "7469793caadbf471": "Too many arguments: expected one key and one value.",
  "747b7d4401fa730f": "Settings History",
  "74adfe43d13594cf": "Use specific domain",
  "74d1aa5fc286dfb8": "MySQL is not in strict mode (on host \"%s\"), but using strict mode is strongly encouraged.",
  "74d23243f911dfb2": "Opcode",
  "74e9e95a9b0e1219": "To update these %d value(s), edit your PHP configuration file.",
  "7541c28d058703f2": "Enable Recaptcha",
  "75440d3f6dd2032b": "Customized Value:",
  "756b23351ba49db8": "Prefix cookie with \"%s\"",
  "76026dfdd00de446": "Migrated option \"%s\" from file to database config.",
  "7658e7642f501c72": "Specify a system user to run the daemons as. Primarily, this user will own the working copies of any repositories that Phabricator imports or manages. This option is new and experimental.",
  "765b946b0057f3ae": "PHP Documentation",
  "76e1d98b2037bc14": "Phabricator now automatically discovers available search engines at runtime.",
  "775a8816a43b005d": "Unable to determine the version number of \"%s\".",
  "77a8141f0570a001": "Config key \"%s\" is of type \"%s\". Specify it in JSON.",
  "77fb474df4497fbf": "Cluster: Databases",
  "785b5a53fdccd152": "None of the caches on this page can be cleared.",
  "785bc0efaddd7a52": "Hashed with other inputs to generate CSRF tokens.",
  "78aa17d9a70d9ffa": "Amazon SES Access Key Not Set",
  "78c48e4df45ef8e9": "Require email verification before a user can log in.",
  "78cdab3abf9dc85d": "Customized",
  "78f3842f0201c993": "Master",
  "7997bdc30794fb0a": "Sets the default color scheme of Phabricator.",
  "79ad276f949f4818": "A Troublesome Encounter!",
  "79f9844de217e102": "Maximum taskmaster daemon pool size.",
  "7a1b287db074cff6": "Replica",
  "7a2785b525e44588": "Use Public Replies (Less Secure)",
  "7a430d918057f35e": "MySQL password to use when connecting to the database.",
  "7a7c9c2b34141d23": "If a variable isn't available (for example, %%m appears in the file format but the request is not a Conduit request), it will be rendered as '-'",
  "7a9799292d1ab6a4": "Hashed with other inputs to generate mail tokens.",
  "7abeda7a4cb35cfe": "You can find more information about configuring OPCache in the %s.",
  "7b1657eb3fc6c8e9": "Set a string Phabricator should use to prefix cookie names.",
  "7b451c08bff6f7d9": "If those commands don't work, try Google. The process of installing PHP extensions is not specific to Phabricator, and any instructions you can find for installing them on your system should work. On Mac OS X, you might want to try Homebrew.",
  "7b5265f8b5ada7c6": "Database Status",
  "7be69b263a727294": "Configure SMS.",
  "7c486df7b1751d0c": "Database host \"%s\" has a configured cluster state which disagrees with the state on this host (\"%s\"). Run `bin/storage partition` to commit local state to the cluster. This host may have started with an out-of-date configuration.",
  "7ccea815768bea3d": "PHP OPCache Documentation",
  "7cf7e8e599e894c7": "Largest",
  "7d247683597331f6": "This option allows you to stop Phabricator from sending any data to external services. Among other things, it will disable email, SMS, repository mirroring, and HTTP hooks.\n\nThis option is intended to allow a Phabricator instance to be exported, copied, imported, and run in a test environment without impacting users. For example, if you are migrating to new hardware, you could perform a test migration first, make sure things work, and then do a production cutover later with higher confidence and less disruption. Without this flag, users would receive duplicate email during the time the test instance and old production instance were both in operation.",
  "7d2a5f05db28803f": "Set the URI that Phurl will use to share shortened URLs.",
  "7d2be54aaa73b40e": "Phabricator users can make requests to other services from the Phabricator host in some circumstances (for example, by creating a repository with a remote URL or having Phabricator fetch an image from a remote server).\n\nThis may represent a security vulnerability if services on the same subnet will accept commands or reveal private information over unauthenticated HTTP GET, based on the source IP address. In particular, all hosts in EC2 have access to such a service.\n\nThis option defines a list of netblocks which Phabricator will decline to connect to. Generally, you should list all private IP space here.",
  "7d6e854e1de2ed3c": "Your version of MySQL (on database host \"%s\") does not support configuration of a stopword file. You will not be able to find search results for common words.",
  "7df8ae5849713a0b": "Your PHP configuration selects an invalid timezone. Select a valid timezone.",
  "7e17a69d5096c5bb": "%s deleted this configuration entry (again?).",
  "7e67081358e0ecc2": "Unresolved Setup Issues",
  "7f392e75b41cc9c7": "Server Timezone Not Configured",
  "7f6672fd8d4466d0": "Default \"From\" address.",
  "7fb894f745adffc9": "Use the %s to manage installed applications.",
  "7fd0894f7e01e83b": "Individual application reply handler domains have been removed. Configure a reply domain with \"%s\".",
  "8012a2b2632e9650": "Application configuration class.",
  "8016a48760c2d557": "Preflight",
  "802023d6f7cfdc2a": "Install these %d PHP extension(s):",
  "8058ec7c47794ce5": "Missing '%s' Binary",
  "805b8364dd741b70": "Charset",
  "811d40c3a237c830": "The framable public feed is no longer supported.",
  "814b61306d97b73f": "Explicit S3 endpoint to use. This should be the endpoint which corresponds to the region you have selected in `amazon-s3.region`. Phabricator can not determine the correct endpoint automatically because some endpoint locations are irregular.",
  "81d0108b9bebb0b9": "developer/",
  "82a71c8e058e57a6": "Phabricator now always sends transaction mail with \"Precedence: bulk\" to improve deliverability.",
  "82c03d17c92e4a54": "%s Day(s)",
  "830df01a4ffc1aed": "This key is too long for utf8mb4.",
  "83235185f54099ff": "Expected Character Set",
  "833b3b877545b9d9": "Repository Servers",
  "8369685cb2499294": "Format for the HTTP access log. Use `%s` to set the path. Available variables are:",
  "83803bf9e3f18961": "Database host \"%s\" is configured to use the default Boolean search syntax when using fulltext indexes. This means searching for 'search words' will yield the query 'search OR words' instead of the desired 'search AND words'.\n\nThis might produce unexpected search results. \n\nYou can change this setting to a more sensible default. Alternatively, you can ignore this warning if using 'OR' is the desired behaviour. If you later plan to configure ElasticSearch, you can also ignore this warning: only MySQL fulltext search is affected.\n\nTo change this setting, add this to your %s file (in the %s section) and then restart %s:\n\n%s\n",
  "83af394eb4ea26f3": "Skipping obsolete option: %s",
  "83b65d06b6b8a1b7": "This schema can use a better collation.",
  "8404078caa02169c": "Mailgun domain name. See %s.",
  "846639183b3dc37e": "Install Pygments to Improve Syntax Highlighting",
  "84ce44de4096d5c3": "Sessions now expire and are garbage collected rather than having an arbitrary concurrency limit.",
  "84f0e95272f65c34": "Logo Image",
  "84fef7cb1d9c8d93": "The environmental variable %s is empty. Phabricator will not be able to execute some commands.",
  "85005beb5f9f6084": "Really Clear Cache",
  "85f66da98fd3941c": "Stop Phabricator from sending any email, etc.",
  "8645ec0ab02ae401": "Database host \"%s\" is using the builtin stopword file for building search indexes. This can make Phabricator's search feature less useful.\n\nStopwords are common words which are not indexed and thus can not be searched for. The default stopword file has about 500 words, including various words which you are likely to wish to search for, such as 'various', 'likely', 'wish', and 'zero'.\n\nTo make search more useful, you can use an alternate stopword file with fewer words. Alternatively, if you aren't concerned about searching for common words, you can ignore this warning. If you later plan to configure ElasticSearch, you can also ignore this warning: this stopword file only affects MySQL fulltext indexes.\n\nTo choose a different stopword file, add this to your %s file (in the %s section) and then restart %s:\n\n%s\n(You can also use a different file if you prefer. The file suggested above has about 50 of the most common English words.)\n\nFinally, run this command to rebuild indexes using the new rules:\n\n%s",
  "867363d40c80c17f": "Unexpected '%s' Behavior",
  "86ff71db3786dccf": "Database Status: %s.%s (%s)",
  "879bf32ba57c791b": "Enable HTTP Strict Transport Security (HSTS).",
  "880f0d8651fa3a0f": "Users can configure a URI pattern to open files in a text editor. The URI must use a protocol on this whitelist.",
  "8851142da56fd885": "Config",
  "89146d51b27513ca": "Retention Policy",
  "8973667cf4a62284": "Config key '%s' is of type '%s'. Specify '%s' or '%s'.",
  "8975c01114f944e3": "Config Option",
  "89c6a787afac5495": "This configuration option is unknown. It may be misspelled, or have existed in a previous version of Phabricator.",
  "8ba0f8010ed999e8": "Whitelist 1.2.*.*",
  "8bbbe8d23d9d0cb9": "Highlight httpd.conf as \"apacheconf\".",
  "8bbfc05a18904c4a": "Database Value",
  "8bfa603ad8c13dd3": "On database host \"%s\", the global %s is set to %s. It is strongly encouraged that you disable this mode when running Phabricator.\n\nWith %s enabled, MySQL rejects queries for which the select list or (as of MySQL 5.0.23) %s list refer to nonaggregated columns that are not named in the %s clause. More importantly, Phabricator does not work properly with this mode enabled.\n\nYou can find more information about this mode (and how to configure it) in the MySQL manual. Usually, it is sufficient to change the %s in your %s file (in the %s section) and then restart %s:\n\n%s\n(Note that if you run other applications against the same database, they may not work with %s. Be careful about enabling it in these cases and consider migrating Phabricator to a different database.)",
  "8c32dd0082c9208e": "Configure TLS or SSL for SMTP.",
  "8c4cbf3a141a09f5": "US Mountain (MDT)",
  "8c8095f2841dda11": "This option has been replaced with `ui.logo`, which provides more flexible configuration options.",
  "8d2fe71c682b68f8": "Learn More: Upstream Discussion",
  "8d64755f4879af8b": "%s Configuration",
  "8e18f04cd8d44d5a": "Launch daemons in 'verbose' mode by default.",
  "8e3dd7b540621328": "Partition: %s",
  "8e459cf20e324eec": "This is an override list of regular expressions which allows you to choose what language files are highlighted as. If your projects have certain rules about filenames or use unusual or ambiguous language extensions, you can create a mapping here. This is an ordered dictionary of regular expressions which will be tested against the filename. They should map to either an explicit language as a string value, or a numeric index into the captured groups as an integer.",
  "8e9818d8abd1ddb6": "Options for Phurl.",
  "8f22309bb6d1d270": "Elasticsearch index Incorrect",
  "8fa141a16eda9318": "IMPORTANT: The upstream does not provide support for prototype applications.\n\nPhabricator includes prototype applications which are in an **early stage of development**. By default, prototype applications are not installed, because they are often not yet developed enough to be generally usable. You can enable this option to install them if you're developing Phabricator or are interested in previewing upcoming features.\n\nTo learn more about prototypes, see [[ %s | %s ]].\n\nAfter enabling prototypes, you can selectively uninstall them (like normal applications).",
  "8fa67bff3b62a43a": "For conduit, the Conduit method which was invoked.",
  "8ff826323a0f02c5": "The configured PATH includes a component which is not usable. Phabricator will be unable to find or execute binaries located here:\n\n%s\n\nThe user that the webserver runs as must be able to read all the directories in PATH in order to make use of them.",
  "901f4c59a1e861ba": "The configuration option '%s' is not set.",
  "9050216ea35ce993": "Enable recaptcha to require users solve captchas after a few failed login attempts. This hinders brute-force attacks against user passwords. For more information, see http://recaptcha.net/",
  "905f63092ff26517": "Sync",
  "90ad08211abcc115": "Stop Before HTTP Redirect",
  "90b5e107dd625349": "Toggle %s-based compression for some caches.",
  "90e97bc318670d3e": "Developer / Debugging",
  "918cbb70c0b91f23": "Remove PHP %s",
  "91a54d91a14bbeda": "The given value must be valid JSON. This means, among other things, that you must wrap strings in double-quotes.",
  "9215c54e8cb1ec74": "Edit Option: %s",
  "92185dc52f71ef75": "Missing",
  "922372c8a94ad8ed": "Classes must match to compare schemata!",
  "9225f336e01cbff6": "Edit These Settings",
  "925b361121b87891": "Unit test value.",
  "9263a4b92b8984d2": "A daemon is running as user %s, but daemons should be running as %s.\n\nEither adjust the configuration setting %s or restart the daemons. Daemons should attempt to run as the proper user when restarted.",
  "9292c7509fad2fc8": "Config key \"%s\" is of type \"%s\". Specify it in JSON. For example:",
  "92a635925b7b3bd8": "Missing Key",
  "9318283be1bd0dfa": "Expected Nullable",
  "934aa1e2bfcd5104": "Amazon SES is selected as the mail adapter, but no SES endpoint is configured. Provide an SES endpoint or choose a different mail adapter.",
  "93d356227f0c55b5": "Disable SSH log.",
  "94476547e6ae130a": "Current Settings",
  "947aa1d77318a819": "No databases have any issues.",
  "95168f04fba5e070": "Trace mode",
  "961262efb547f170": "Notifications no longer have a dedicated debugging mode.",
  "969315f0d6a19417": "Daemon Running as Wrong User",
  "970004fcb758ad4d": "Option '%s' must be a list of regular expressions, but value is not an array.",
  "97dcd427a7e15666": "Extending Phabricator",
  "985c31000340fef5": "You enabled Elasticsearch but the index does not exist.",
  "985ea3b57a8fc6f5": "%s Not Found",
  "9965af55c263e991": "Phabricator PHP 7 Compatibility Information",
  "99a86ed5e12e2032": "Your `%s` configuration contains a port number, but this usage is deprecated. Instead, put the port number in `%s`.",
  "9a2aa66e50172cd7": "Maniphest is currently configured with deprecated policy settings which will be removed in a future version of Phabricator.",
  "9a46a782d8fcd840": "Column has Wrong Autoincrement",
  "9a4f2bfa2a31e4c1": "Configure PHPMailer.",
  "9a83e176af46a285": "Memory Limit Restricts File Uploads",
  "9a87067214a11226": "Cache Entries",
  "9aa2f6b1826d876a": "Unknown column type \"%s\"!",
  "9af8c2f54dd6a3ff": "Configured location for storing uploaded files on disk (\"%s\") does not exist, or is not readable or writable. Verify the directory exists and is readable and writable by the webserver.",
  "9b2bde4956b2ca07": "Notifications User Guide: Setup and Configuration",
  "9b687ea0b610e17f": "Config option '%s' is invalid. The URI must start with %s' or '%s'.",
  "9b8ef59172851725": "No Herald Hints",
  "9bcb1aa0cb2a544b": "Key is Too Long",
  "9c0d5fe6465e44ef": "'%s' Missing",
  "9c142485f020916b": "Configure database read replicas.",
  "9c183382e10369c1": "Elasticsearch Misconfigured",
  "9d33df4cbd01cb82": "Amazon S3 is Only Partially Configured",
  "9d6fa285df9deb95": "Phabricator no longer supports global customization of monospaced fonts.",
  "9e0230ee43e55ce2": "The PATH component '%s' (which resolves as the absolute path '%s') is not usable because it is not traversable (its '%s' permission bit is not set).",
  "9e10d4517d5a2f4e": "SMS",
  "9e58e005b25867aa": "No Repositories",
  "9ebe77a4a742b2dd": "%s deleted this configuration entry.",
  "9f5b3e83e08248f9": "Mail is now always delivered by the daemons.",
  "9fdfdb73068e71ee": "Request has bad \"Host\" header.",
  "a004d118b092c10b": "This version of Subversion has a bug where `%s` does not work for files added in rN (Subversion issue #2873), fixed in 1.7.2.",
  "a022853382dc7100": "Option '%s' must be a set, but value is not an array.",
  "a0251ad3f6da00fd": "Elasticsearch is not reachable as configured.",
  "a044102f7f93e256": "Cluster Repository Status",
  "a063971bb12aabfb": "Key has Wrong Uniqueness",
  "a115ffa63c244062": "Determines whether or not basic account information is editable.",
  "a11d0b1afd779693": "Get a local configuration value.",
  "a221066e1bf4df20": "The base URI for this install is not configured. Many major features will not work properly until you configure it.",
  "a225a203f74eda9a": "Unexpected 'diff' Behavior",
  "a2b853fb3b0aaedf": "The '%s' binary on this system has unexpected behavior: it was expected to exit with a nonzero error code when passed differing files, but did not.",
  "a2f11ad5401e99f4": "You can ignore an issue if you don't want to fix it, or plan to fix it later. Ignored issues won't appear on every page but will still be shown in the list of open issues.",
  "a30c1294650983e1": "Enter value in JSON.",
  "a33b1aaa635677c9": "Migrated option \"%s\" from file to local config.",
  "a3632de0c1420398": "Shenanigans",
  "a36364be86e2629e": "The path for local repositories does not exist, or is not readable by the webserver.",
  "a374062408634d6b": "Verbose mode",
  "a404e10af0a472fd": "Config '%s' Invalid",
  "a4174c925e39b378": "A database host (\"%s\") and this web host (\"%s\") disagree on the current time by more than 60 seconds (absolute skew is %s seconds). Check that the current time is set correctly everywhere.",
  "a48b48272cde41c6": "30 characters",
  "a55247871933d851": "No Recipient Hints",
  "a594f4d031aacbf0": "US West (Oregon)",
  "a5c31f4f7336dc40": "Sample 0.1%% of requests.",
  "a5fd61b3ca79b110": "No Issues",
  "a602c47f713c985d": "No Caches to Reset",
  "a608b40e871b0fc4": "No Base URI",
  "a620dcfcfbad6a97": "Really Clear Cache?",
  "a63f2526b259fe40": "Allow Any Host (Insecure!)",
  "a6765aa52cc72eec": "Collectors with custom policies are highlighted. Use %s to change retention policies.",
  "a6c92f7f3b70ab51": "Multi-Factor Required",
  "a70aaaf24a0dbdd0": "Host: %s",
  "a73f5643a10ca9cf": "Amazon SES Endpoint Not Set",
  "a802903e9ac96a8e": "URI that Phurl will use to shorten URLs.",
  "a8842173f1c78cae": "Local Version",
  "a8abf509bd467909": "Profile every request (slow)",
  "a916fa737a0a006c": "Resolved Issue",
  "a9815e95cd11c1fc": "Is basic account information (email, real name, profile picture) editable? If you set up Phabricator to automatically synchronize account information from some other authoritative system, you can disable this to ensure information remains consistent across both systems.",
  "a9856690f2e85e4c": "Option '%s' must be a list of strings, but value is not an array.",
  "a9d55954546ce458": "To enable the Phabricator access log, specify a path. The Phabricator access than normal HTTP access logs (for instance, it can show logged-in users, controllers, and other application data).\n\nIf not set, no log will be written.",
  "aa2913c21afaf35d": "Schema Status",
  "aa7ead92cb0cc90c": "To update these %d value(s), run these command(s) from the command line:",
  "aab574c607041f76": "You have '%s' enabled in your PHP configuration.\n\nThis option is not compatible with Phabricator. Remove '%s' from your configuration to continue.",
  "ab53b43936fcdaa7": "At least one daemon is currently running as the wrong user.",
  "ab7f244fc5171be6": "Data Type",
  "abd4238daeaed5a0": "Better Character Set Available",
  "abd5080658c27d7f": "Small MySQL \"%s\"",
  "ac144b603ed985f2": "The request path, or request target.",
  "ac6bba416bb9af4a": "%s Active / %s Total",
  "ac9041e76816a34a": "Automatic",
  "aca851b5d634f676": "Connection Error",
  "acd9f943dffcc5cf": "Options relating to authentication.",
  "ad1f9c76348f9093": "Migrating file source...",
  "ad40fa2c637f8193": "Autoincrement",
  "ad57c6a2df44539d": "Current Value:",
  "ae0198458dc4ab19": "Install applications which are still under development.",
  "aea3def365e1a2e2": "Return to Open Issue List",
  "af0f8e2a15e605ce": "Set this to false to disable the use of %s-based compression in some caches. This may give you less performant (but more debuggable) caching.",
  "af30dfb16b478dda": "Activate read-only mode for maintenance or disaster recovery.",
  "af379b9074a3c8e2": "Specify a configuration key and a value to set it to.",
  "af48448c15bcd46c": "PHP also loaded these %s configuration file(s):",
  "afc542d9c0774bb6": "Disable Recaptcha",
  "afda8af10997e4fb": "This request did not include a \"Host\" header. This may mean that your webserver (like nginx or apache) is misconfigured so the \"Host\" header is not making it to Phabricator, or that you are making a raw request without a \"Host\" header using a tool or library.\n\nIf you are using a web browser, check your webserver configuration. If you are using a tool or library, check how the request is being constructed.\n\nIt is also possible (but very unlikely) that some other network device (like a load balancer) is stripping the header.\n\nRequests must include a valid \"Host\" header.",
  "afef721b35eee706": "Sample every request (slow).",
  "b02295e3b4dabd10": "'%s' binary not found or Imagemagick is not installed.",
  "b0e44ae9f332e324": "This value is an input to the hash function when building resource hashes. It has no security value, but if you accidentally poison user caches (by pushing a bad patch or having something go wrong with a CDN, e.g.) you can change this to something else and rebuild the Celerity map to break user caches. Unless you are doing Celerity development, it is exceptionally unlikely that you need to modify this.",
  "b1892c93df603f4f": "The PATH component '%s' (which resolves as the absolute path '%s') is not usable because '%s' does not exist.",
  "b1e4b45d8d795dcf": "Elasticsearch index Not Found",
  "b1fd7eacc2ca1dc2": "Phabricator has %s available in %s, but the binary exited with an error code when run as %s. Check that it is installed correctly.",
  "b2366d9d7ba5fd0a": "The current PHP configuration has these %d value(s):",
  "b254c467b1b229e2": "This issue is currently ignored, and does not show a global warning.",
  "b25a322a96a419c3": "Cache Status",
  "b3bdc4b018269b11": "You have at least one repository configured which uses this version control system. It will not work without the VCS binary.",
  "b4381bf0cf569c22": "Done. Migrated %d keys.",
  "b438996795a36c3f": "Amazon SES is selected as the mail adapter, but no SES access key is configured. Provide an SES access key, or choose a different mail adapter.",
  "b4af392332da48a5": "The remote IP.",
  "b4c3d1e703762425": "Disable Prototypes",
  "b4f1a4a57aa145e4": "US West (PDT)",
  "b500a6f2366729f5": "Deleted '%s' from %s configuration.",
  "b53bf0183641838d": "Class is not of valid type.",
  "b55c89f2a3bc58be": "Run Normally",
  "b58403cf4275c06a": "Account ID on Twilio service.",
  "b5e22d3d9b924a2f": "Highlight %s as PHP.",
  "b5ea792459f8641b": "Launch daemons in 'trace' mode by default. This creates an ENORMOUS amount of output, but can help debug issues. Daemons launched in debug mode with '%s' are always launched in trace mode. See also '%s'.",
  "b60d9dcd725c1c7d": "MySQL is Using Default Stopword File",
  "b68e2790c770b445": "Paths to additional phutil libraries to load.",
  "b6f91ef89c55b965": "User Guide: Prototype Applications",
  "b72388b6496bb62d": "If you enable this, linked YouTube videos will be embedded inline. This has mild security implications (you'll leak referrers to YouTube) and is pretty silly (but sort of awesome).",
  "b8209841063c5d48": "The '%s' binary could not be located or executed.",
  "b82bb6625a2df5b0": "Show Email Preferences Link",
  "b865fb8160466bbb": "Confirm before redirecting so DarkConsole can be examined.",
  "b8f2c231061b45d1": "You have '%s' enabled in your PHP configuration.\n\nThis option is not compatible with Phabricator. Disable '%s' in your PHP configuration to continue.",
  "b91faec0757b2b81": "Editable",
  "b96fc6c0118f6b9f": "WARNING: This is a very advanced option, and only useful for hosting providers running multi-tenant clusters.\n\nIf you provide an instance identifier here (normally by injecting it with a `%s`), Phabricator will pass it to subprocesses and commit hooks in the `%s` environmental variable.",
  "b984192075350071": "Phabricator can highlight a few languages by default, but installing and enabling Pygments (a third-party highlighting tool) will add syntax highlighting for many more languages. \n\nFor instructions on installing and enabling Pygments, see the %s configuration option.\n\nIf you do not want to install Pygments, you can ignore this issue.",
  "b992d1944e91f7ac": "On host \"%s\", MySQL is configured with a small \"%s\" (%d), which may cause some large writes to fail. The recommended minimum value for this setting is \"%d\".",
  "ba610a8c1689813c": "The PATH component '%s' (which resolves as the absolute path '%s') is not usable because '%s' is not a directory.",
  "bac637381de16337": "Unable to connect to MySQL!\n\n%s\n\nMake sure Phabricator and MySQL are correctly configured.",
  "bae07107c4ce3cde": "After installing new PHP extensions, <strong>restart Phabricator for the changes to take effect</strong>. For help with restarting Phabricator, see %s in the documentation.",
  "bbd685ee94ff06b2": "Set the language list which appears in dropdowns.",
  "bbe739383e01732d": "Inverse",
  "bc1c7eabf55849a5": "SendGrid API key.",
  "bc28746880089987": "Mailgun API key.",
  "bcd939e4e0cf37d5": "Indefinite",
  "bcedb3f03341c6b4": "Mail is normally encoded in `8bit`, which works correctly with most MTAs. However, some MTAs do not work well with this encoding. If you're having trouble with mail being mangled or arriving with too many or too few newlines, you may try adjusting this setting.\n\nSupported values are `8bit`, `quoted-printable`, `7bit`, `binary` and `base64`.",
  "be21163ec12960c1": "Access key for Amazon SES.",
  "be7444e854579896": "Edge Types",
  "bee88b6fe82e2621": "Disable access log.",
  "beeed8a6c21acc57": "Logo configuration is not valid: value must be a dictionary.",
  "befa01fa553d1e88": "Really ignore this setup issue?",
  "bf91ee29dcfbb30a": "Phabricator supports syntax highlighting a few languages by default, but you can install Pygments (a third-party syntax highlighting tool) to provide support for many more languages.\n\nTo install Pygments, visit [[ http://pygments.org | pygments.org ]] and follow the download and install instructions.\n\nOnce Pygments is installed, enable this option (`pygments.enabled`) to make Phabricator use Pygments when highlighting source code.\n\nAfter you install and enable Pygments, newly created source code (like diffs and pastes) should highlight correctly. You may need to clear Phabricator's caches to get previously existing source code to highlight. For instructions on managing caches, see [[ %s | Managing Caches ]].",
  "bfa362f7819bbfa5": "Options relating to syntax highlighting source code.",
  "bfb9aa1dca8f9aa6": "Allow HTTP",
  "bff657d6f5bb1c26": "The current Phabricator configuration has these %d value(s):",
  "c0faa99a75ff8be3": "MySQL (on host \"%s\") is configured to search on fulltext indexes using \"OR\" by default. Using \"AND\" is usually the desired behaviour.",
  "c15fa4b758d35cc9": "Simple Example",
  "c195e4374c85d74c": "Synchronized",
  "c22b2615738b8f9f": "Configuration Hidden",
  "c25957c9d1c91285": "Access key for Amazon EC2.",
  "c26f68e4c6f17ca6": "%s Component Unusable",
  "c279cd33a3193438": "Unsynchronized",
  "c2930ef7dbff2f2a": "Key for HMAC digests.",
  "c407b8b652fbdd95": "The request duration, in microseconds.",
  "c4347250bfbdc421": "Phabricator now supports arbitrarily large files. Consult the documentation for configuration details.",
  "c44f1d5a2f59c989": "Amazon S3 region where your S3 bucket is located. When you specify a region, you should also specify a corresponding endpoint with `amazon-s3.endpoint`. You can find a list of available regions and endpoints in the AWS documentation.",
  "c453c9c56f262f25": "To enable the Phabricator SSH log, specify a path. The access log can provide more detailed information about SSH access than a normal SSH log (for instance, it can show logged-in users, commands, and other application data).\n\nIf not set, no log will be written.",
  "c467aed720f8d5ec": "MySQL %s Not Supported",
  "c48146e98572f09a": "The \"InnoDB\" engine is not available in MySQL (on host \"%s\"). Enable InnoDB in your MySQL configuration.\n\n(If you aleady created tables, MySQL incorrectly used some other engine to create them. You need to convert them or drop and reinitialize them.)",
  "c4f21bfc00a365e7": "Controls whether Phabricator sends email \"From\" users.",
  "c5046922441da3f8": "Auth Application",
  "c5f4b383eb88aacf": "All Differential fields are now managed through the configuration option \"%s\". Use that option to configure which fields are shown.",
  "c623d91b35f7352e": "By default, Phabricator includes some flavor text in the UI, like a prompt to \"Weigh In\" rather than \"Add Comment\" in Maniphest. If you'd prefer more traditional UI strings like \"Add Comment\", you can set this flag to disable most of the extra flavor.",
  "c643188c5cf69c2e": "Use HSTS",
  "c64d434806d275ac": "The current MySQL configuration has these %d value(s):",
  "c682d63af19ed69b": "Database host \"%s\" is configured with a very small %s (%s). This may cause poor database performance and lock exhaustion.\n\nThere are no hard-and-fast rules to setting an appropriate value, but a reasonable starting point for a standard install is something like 40%% of the total memory on the machine. For example, if you have 4GB of RAM on the machine you have installed Phabricator on, you might set this value to %s.\n\nYou can read more about this option in the MySQL documentation to help you make a decision about how to configure it for your use case. There are no concerns specific to Phabricator which make it different from normal workloads with respect to this setting.\n\nTo adjust the setting, add something like this to your %s file (in the %s section), replacing %s with an appropriate value for your host and use case. Then restart %s:\n\n%s\nIf you're satisfied with the current setting, you can safely ignore this setup warning.",
  "c701bdda703a7a4f": "Show \"To:\" and \"Cc:\" footer hints in email.",
  "c77d71dbd30a01fc": "Write SSH log here.",
  "c7b0aa24062129ce": "PHP Timezone",
  "c7f627d25a05b539": "Missing Sendmail",
  "c8226aa697311e97": "This option is not recognized. It may be misspelled.",
  "c83e51bab12ec85b": "Customized settings for Phabricator applications.",
  "c89803cbc484a78d": "Unable to determine the version number of \"%s\". Usually, this means the program changed its version format string recently and Phabricator does not know how to parse the new one yet, but might indicate that you have a very old (or broken) binary.\n\nBecause we can not determine the version number, checks against minimum and known-bad versions will be skipped, so we might fail to detect an incompatible binary.\n\nYou may be able to resolve this issue by updating Phabricator, since a newer version of Phabricator is likely to be able to parse the newer version string.\n\nIf updating Phabricator does not fix this, you can report the issue to the upstream so we can adjust the parser.\n\nIf you are confident you have a recent version of \"%s\" installed and working correctly, it is usually safe to ignore this warning.",
  "c8abcefa3f2571ad": "Internal.",
  "c8ff33edc86cd0da": "Phabricator can highlight PHP by default and use Pygments for other languages if enabled. You can provide a custom highlighter engine by extending class %s.",
  "c9c414be794cdcbd": "Integration with SendGrid",
  "ca04332fe3fbc2d0": "SSH log format.",
  "ca0d6c63e912aa96": "The '%s' extension is not installed. Without '%s', support, Phabricator may not be able to determine the MIME types of uploaded files.",
  "cb4ef88ed38bce10": "Config option '%s' is invalid. The URI must NOT have a path, e.g. '%s' is OK, but '%s' is not. Phabricator must be installed on an entire domain; it can not be installed on a path.",
  "cb571e6f6b452090": "Configure how mail is encoded.",
  "cbae4a9b31212d13": "Do Not Use HSTS",
  "cbc9f47d5f4fd578": "Phabricator now has application-level management of partitioning and replicas.",
  "cbf8bca51e649987": "List all configuration keys.",
  "cc021eb3160f695d": "Deprecated Policies",
  "cc6c5d5c4b9a2d4f": "This will only affect the current web frontend. Daemons and any other web frontends may continue to use older, cached code from their opcache.",
  "cc6f6446f3cb7c10": "Domain used to generate Message-IDs.",
  "ccfc8d726df2a242": "Minify static resources.",
  "cd48eba520f21b42": "Configure real-time notifications.",
  "cd4a55adc93344e0": "Surplus Key",
  "cd9197a19c069de1": "Make Phabricator even cooler!",
  "cdc99c07b150d860": "Cluster Setup",
  "cdd779c5d431347f": "Obsolete Configuration Option \"%s\"",
  "cdd7bb2816b7a8f8": "Setup",
  "ce762c21d818cb87": "The version of %s on this system is out of date and contains a major, widely disclosed vulnerability (the \"Shellshock\" vulnerability).\n\nUpgrade %s to a patched version.\n\nTo learn more about how this issue affects Phabricator, see %s.",
  "cff4007d157ab559": "Database: %s.%s",
  "d066558b75d797f1": "Expected Autoincrement",
  "d0b77900f21af8d1": "This version of Mercurial has a significant memory leak, fixed in 2.2.1. Pushing fails with this version as well; see %s.",
  "d0e8eab44d19be55": "MySQL is configured (on host \"%s\") to only index words with at least %d characters.",
  "d147c64fcad4e155": "The '%s' extension is not installed. Without '%s', support, Phabricator will not be able to process or resize images (for example, to generate thumbnails). Install or enable '%s'.",
  "d16848e4d26bb7e5": "Phabricator Setup Error",
  "d1d25e76b3dbf09d": "Major Web/Database Clock Skew",
  "d1f9603033bd63c3": "No repository cluster services are configured.",
  "d27b4fd727666f53": "Syntax Highlighting",
  "d292367e6cf4c776": "This schema is not expected to exist.",
  "d2e7266b857f4b16": "This configuration value is defined in these %d configuration source(s): %s.",
  "d3007521547d841b": "Specify a configuration key to get.",
  "d3079f098678b02f": "Can not compare two missing schemata!",
  "d34209f83a4f85f2": "Key on Wrong Columns",
  "d347be309a21b401": "S3 Partially Configured",
  "d34e7deba5fc16af": "Migrate file-based configuration to more modern storage.",
  "d35508d16e8822b2": "Skipping config of source type %s...",
  "d36a313c7a9f011a": "No profiling",
  "d36ad599a36313c6": "PHID Types",
  "d3aa13ccb26318d4": "The environmental variable %s does not contain %s. You have enabled pygments, which requires %s to be available in your %s variable.",
  "d3aafd3c11ff50f3": "Use Pygments",
  "d3e00d24b34937e8": "Amazon Web Services",
  "d47b704ba5536d0d": "US Central (CDT)",
  "d485fb1b8a1e4854": "%s Active",
  "d49262edbc1ae5bd": "Subschemata Have Warnings",
  "d495afb84cd2b50f": "The base URI for this install is not configured, and major features will not work properly until you configure it.\n\nYou should set the base URI to the URI you will use to access Phabricator, like \"http://phabricator.example.com/\".\n\nInclude the protocol (http or https), domain name, and port number if you are using a port other than 80 (http) or 443 (https).\n\nBased on this request, it appears that the correct setting is:\n\n%s\n\nTo configure the base URI, run the command shown below.",
  "d4cd7afdef77bc02": "Require Administrators to Approve Accounts",
  "d4fc4b55e1406857": "Set %s in your PHP configuration to at least 32MB to support large file uploads.",
  "d56976c8e564d50b": "The system sudo user.",
  "d5a80ca6250fabff": "When users write comments which have URIs, they'll be automatically linked if the protocol appears in this set. This whitelist is primarily to prevent security issues like %s URIs.",
  "d5ff9db2117a3add": "MySQL %s Mode Not Set",
  "d64bca917efe9bb6": "Phabricator Daemons Are Not Running",
  "d6592b222ea737f7": "A component of the configured PATH can not be used by the webserver: %s",
  "d6a7b6761e9c7996": "Directory that phd should use to track running daemons.",
  "d6bb90295d040e32": "Port for SMTP.",
  "d7541d1e6b26d119": "Use specific endpoint",
  "d75dc68bbdd56c9c": "Cluster",
  "d7a57d123c080ad0": "Configure Recaptcha captchas.",
  "d7f18d62586b1ac6": "Report this Issue to the Upstream",
  "d841ff3ce299c749": "Options relating to PHD (daemons).",
  "d84c1eb8c3d9980d": "Repos",
  "d8868a0c162e6b8d": "Database configuration.",
  "d8c3c8b3459b6301": "application/",
  "d8cbd1d0234f4d12": "Options for Phabricator developers, including debugging.",
  "d95b3dcd125b1187": "Option '%s' must be a list of strings, but it contains one or more non-strings.",
  "d98db4d0159b5a1d": "Value must be an integer.",
  "d9f1dd6b7972c21e": "Increase security (and improve performance) by configuring a CDN or alternate file domain.",
  "dac6b24f78471a13": "Basic Example",
  "db4d6848484d7048": "%s In / %s Out",
  "db6bb445b935e2f8": "DarkConsole is a development and profiling tool built into Phabricator's web interface. You should leave it disabled unless you are developing or debugging Phabricator.\n\nOnce you activate DarkConsole for the install, **you need to enable it for your account before it will actually appear on pages.** You can do this in Settings > Developer Settings.\n\nDarkConsole exposes potentially sensitive data (like queries, stack traces, and configuration) so you generally should not turn it on in production.",
  "dbc40297118a8517": "The timezone Phabricator should use.",
  "dc5a1805dd07bf3a": "Whitelist Specific Addresses",
  "dceae75a7e19debc": "Use `%s` instead of this option.",
  "dd4fb6228d518968": "Control how Phabricator renders user names in mail.",
  "de0d5df59b579dcb": "You have not configured any authentication providers yet. You should add a provider (like username/password, LDAP, or GitHub OAuth) so users can register and log in. You can add and configure providers using the Auth Application.",
  "de346daa6828a02c": "Run the storage upgrade script to upgrade databases (host \"%s\" is out of date). Missing patches: %s.",
  "deaa0c393a661397": "MySQL",
  "df4761083dc02444": "Serious business",
  "df68e579d8cc8fd6": "This is hashed with other inputs to generate CSRF tokens. If you want, you can change it to some other string which is unique to your install. This will make your install more secure in a vague, mostly theoretical way. But it will take you like 3 seconds of mashing on your keyboard to set it up so you might as well.",
  "dfd7feced046a299": "External loaders have been replaced. Extend `%s` to implement new PHID and handle types.",
  "e01fe67eead85f97": "Cluster Notifications",
  "e07d87ad00e138cf": "You likely need to fix your preamble script so REMOTE_ADDR is no longer empty.",
  "e0f8a9e9b13bd276": "Unknown Config",
  "e1150f10b86c79c2": "Restarting Phabricator",
  "e1757778a55c39cb": "Detected %s serious issue(s) with the schemata.",
  "e193c9b0f2511859": "Daemons Not Running",
  "e1b7810121e8e9c0": "MySQL username to use when connecting to the database.",
  "e21bd98a2fb2e2b5": "Secret key for Amazon EC2.",
  "e2384243b105eb4c": "Database Issues",
  "e28d7139eb798d4a": "You must start the Phabricator daemons to send email, rebuild search indexes, and do other background processing.",
  "e2978b44d112ec82": "PHP requires that you set a timezone in your php.ini before using date functions, or it will emit a warning. If this isn't possible (for instance, because you are using HPHP) you can set some valid constant for %s here and Phabricator will set it on your behalf, silencing the warning.",
  "e2afe20e8ddf6d06": "These %d configuration value(s) are related:",
  "e2d9deaf91517e75": "Names must match to compare schemata!",
  "e342de6e92ac9265": "Core Settings",
  "e3d75419a4519d69": "Set '%s' in %s configuration.",
  "e3dfda08109dc9de": "Setup Checks",
  "e4b02f37f2f4b578": "Database host \"%s\" is configured as a master, but is replicating another host. This is dangerous and can mangle or destroy data. Only replicas should be replicating. Stop replication on the host or reconfigure Phabricator.",
  "e5329412e80c9f76": "Placeholder for mail with only CCs.",
  "e55f11eeacb9f5b4": "This system has an unpatched version of Bash with a severe, widely disclosed vulnerability.",
  "e571a882871231a9": "No Auth Providers",
  "e5781074e118936b": "Missing Required Extensions",
  "e5dc87d52911bd77": "Value must be boolean, \"true\" or \"false\".",
  "e5e6ec2507e7b9f9": "The '%s' extension has support for only some image types. Phabricator will be unable to process images of the missing types until you build '%s' with support for them. Supported types: %s. Missing types: %s.",
  "e6295d97b3e69b19": "This option has been migrated to the \"Auth\" application. Your old configuration is still in effect, but now stored in \"Auth\" instead of configuration. Going forward, you can manage authentication from the web UI.",
  "e6fbbaaa11cfc5d3": "The '%s' binary could not be found. Set the webserver's %s environmental variable to include the directory where it resides, or add that directory to '%s' in the Phabricator configuration.",
  "e71760ea1e1c874a": "To continue, resolve this problem and reload the page.",
  "e72cf4a48fb739fe": "Phabricator is currently configured to serve user uploads directly from the same domain as other content. This is a security risk.\n\nConfigure a CDN (or alternate file domain) to eliminate this risk. Using a CDN will also improve performance. See the guide below for instructions.",
  "e747f80719988e80": "Wordmark",
  "e77b1d7323c4a938": "Severe Security Vulnerability: Unpatched Bash",
  "e78a7761a913bbb4": "Force HTTPS",
  "e79da23403044aa9": "Without '%s', Phabricator will not be able to generate or render diffs in multiple applications.",
  "e821778cf869bed8": "Send as Phabricator",
  "e83e600d8697e426": "This key is not expected to exist.",
  "e87bc3953ef87879": "Default key for HMAC digests where the key is not important (i.e., the hash itself is secret). You can change this if you want (to any other string), but doing so will break existing sessions and CSRF tokens.",
  "e8ce3aae1f28767a": "%d related link(s):",
  "e916bec76b86928a": "Missing Repository Local Path",
  "e91767018cb4e98c": "Disallow Reply-To Auth",
  "e93c8f350e58f057": "An alternate resource map is no longer supported. Instead, use multiple maps. See T4222.",
  "e942d3f84db424a1": "Inline comments are now always rendered with a limited amount of context.",
  "e943a4c69b880534": "Your server is configured with '%s', which prevents Phabricator from opening files it requires access to.\n\nDisable this setting to continue.",
  "e97eee87a79a3ebb": "Show hints about Herald rules in email.",
  "e99365deb37f1903": "Separate values with newlines or commas.",
  "ea22d5b61b87e6a0": "Don't require email verification",
  "eaf2657a8310462b": "Alternate File Domain Not Configured",
  "ebb8ea8ea2e23d05": "Newly registered Phabricator accounts can either be placed into a manual approval queue for administrative review, or automatically activated immediately. The approval queue is enabled by default because it gives you greater control over who can register an account and access Phabricator.\n\nIf your install is completely public, or on a VPN, or users can only register with a trusted provider like LDAP, or you've otherwise configured Phabricator to prevent unauthorized registration, you can disable the queue to reduce administrative overhead.\n\nNOTE: Before you disable the queue, make sure {{auth.email-domains}} is configured correctly for your install!",
  "ebc46601db318916": "Unknown schema issue \"%s\"!",
  "ec2f3463807de531": "Limit page execution time to debug hangs.",
  "ec6e519522fea180": "Base URI Not Configured",
  "ed269e6426955aa2": "Always Activate DarkConsole",
  "ed5170cd339b4047": "User Interface",
  "ed6e66993c7ba133": "No Schema Issues",
  "ed7cf68657113e8c": "MySQL database hostname.",
  "edcc0a207ce31fa3": "Obsolete Config",
  "ede9d691c0f833db": "Clustering Introduction",
  "ee4d6aed6696fa32": "By default, Phabricator serves files from the same domain the application is served from. This is convenient, but presents a security risk.\n\nYou should configure a CDN or alternate file domain to mitigate this risk. Configuring a CDN will also improve performance. See [[ %s | %s ]] for instructions.",
  "ee81c78dc30eef3e": "MySQL on this machine",
  "ef379ba5cd3db884": "No such configuration key '%s'! Use `%s` to list all keys.",
  "ef4daa078cc1d50c": "You can respond to various application events by installing listeners, which will receive callbacks when interesting things occur. Specify a list of classes which extend PhabricatorEventListener here.",
  "ef58bdeca6a37b8c": "When you upload a file via drag-and-drop or the API, chunks must be buffered into memory before being written to permanent storage. Phabricator needs memory available to store these chunks while they are uploaded, but PHP is currently configured to severly limit the available memory.\n\nPHP processes currently have very little free memory available (%s). To work well, processes should have at least %s.\n\n(Note that the application itself must also fit in available memory, so not all of the memory under the memory limit is available for running workloads.)\n\nThe easiest way to resolve this issue is to set %s to %s in your PHP configuration, to disable the memory limit. There is usually little or no value to using this option to limit Phabricator process memory.\n\nYou can also increase the limit or ignore this issue and accept that you may encounter problems uploading large files and processing large requests.",
  "ef6d981117272f01": "This install has a fatal setup error, access the web interface to view details and resolve it.",
  "ef71b2c49486cf9b": "Disallow",
  "ef91a72580d5f38d": "Alternate domain to serve files from.",
  "efcb7c0d6d4b1e7a": "Amazon SES requires verification of the \"From\" address, but you have not configured a \"From\" address. Configure and verify a \"From\" address, or choose a different mail adapter.",
  "efcbb89aec517541": "Default non-pygments syntax highlighter engine.",
  "efe645e129c07fb6": "Some policy settings in Maniphest are now deprecated and will be removed in a future version of Phabricator. You are currently using at least one of these settings.\n\nThe deprecated settings are \"Can Assign Tasks\", \"Can Edit Task Policies\", \"Can Prioritize Tasks\", \"Can Edit Task Projects\", and \"Can Edit Task Status\". You can find these settings in Applications, or follow the link below.\n\nYou can find discussion of this change (including rationale and recommendations on how to configure similar features) in the upstream, at the link below.\n\nTo resolve this issue, set all of these policies to \"All Users\" after making any necessary form customization changes.",
  "f012eb9fc9a96834": "HTTP Parameter Types",
  "f13cb8678bd51438": "Setup issues to ignore.",
  "f16727b72ea00552": "By default, Phabricator links object names in Remarkup fields to the corresponding object. This regex can be used to modify this behavior; object names that match this regex will not be linked.",
  "f177c20200847198": "Directory that the daemons should use to store log files.",
  "f17beb7e5d5403ac": "Elasticsearch is configured (with the %s setting) but Phabricator encountered an exception when trying to test the index.\n\n%s",
  "f1b7045f165be00b": "Only allow registration from particular domains.",
  "f1b745c5c664a08a": "Subschemata have setup failures.",
  "f1c0e3acaad9ab6f": "Normally, Phabricator issues HTTP redirects after a successful POST. This can make it difficult to debug things which happen while processing the POST, because service and profiling information are lost. By setting this configuration option, Phabricator will show a page instead of automatically redirecting, allowing you to examine service and profiling information. It also makes the UX awful, so you should only enable it when debugging.",
  "f24e15f91c3c9527": "No performance sampling.",
  "f36a227ecb81f7a3": "Opcode Cache",
  "f37eb5d7f91d58df": "ID of the SSH key used to authenticate the request.",
  "f3acd6a83943b3e7": "US East (EDT)",
  "f3c6e9127363e82f": "The HTTP referrer.",
  "f3d595f4f8f46279": "Better Collation Available",
  "f42ebadef9811c77": "View \"%s\"",
  "f43df6c00c7633f4": "This setup issue has been resolved. ",
  "f464788a3a4d94b8": "Additional configuration options to hide.",
  "f4a1d55936ea7f9f": "PHPMailer",
  "f4c323f5e639dbcf": "The logged-in username, if one is logged in.",
  "f4d51ac27c07afc1": "On database host \"%s\", the global %s is not set to %s. It is strongly encouraged that you enable this mode when running Phabricator.\n\nBy default MySQL will silently ignore some types of errors, which can cause data loss and raise security concerns. Enabling strict mode makes MySQL raise an explicit error instead, and prevents this entire class of problems from doing any damage.\n\nYou can find more information about this mode (and how to configure it) in the MySQL manual. Usually, it is sufficient to add this to your %s file (in the %s section) and then restart %s:\n\n%s\n(Note that if you run other applications against the same database, they may not work in strict mode. Be careful about enabling it in these cases.)",
  "f4e6a16538c64eaa": "By default, Phabricator allows users to add multi-factor authentication to their accounts, but does not require it. By enabling this option, you can force all users to add at least one authentication factor before they can use their accounts.",
  "f500301877ad4543": "No REMOTE_ADDR available",
  "f5d8a1c490d782b6": "Minify static Celerity resources.",
  "f613bb9e47861b29": "File storage in Amazon S3 has been partially configured, but you are missing some required settings. S3 will not be available to store files until you complete the configuration. Either configure S3 fully or remove the partial configuration.",
  "f66f483134ee4deb": "The logged-in user PHID, if one is logged in.",
  "f67b2904a7705331": "Option '%s' is of type int, but value is not an integer.",
  "f6a4cb99647b7511": "US East (N. Virginia, Older default endpoint)",
  "f6ac74c77426f288": "Version Information",
  "f74d0a69f5036911": "Option '%s' must be a list of regular expressions, but the value is a map with unnatural keys.",
  "f7b0b002ad840027": "Surplus",
  "f7da70d5712e7470": "You have enabled Imagemagick in your config, but the '%s' binary is not in the webserver's %s. Disable imagemagick or make it available to the webserver.",
  "f83f3759d511811e": "Instance identifier for multi-tenant clusters.",
  "f86b969bb9831a26": "Upgrade MySQL Schema",
  "f8cc8ee9ad1a65fa": "Unignore Setup Issue",
  "f8d6e28b7541a06e": "Automatically sample some fraction of requests.",
  "f8f5fb0418abca01": "SSH log location.",
  "f906c4bec1e7f017": "Delete a local configuration value.",
  "f9c99a937eb57599": "Phabricator can use less-secure but mailing list friendly public reply addresses.",
  "fa2f561c2e347d26": "These paths get appended to your %s environment variable.",
  "fa4ce20781c61fcf": "These alternative URIs will be able to access 'normal' pages on your Phabricator install. Other features such as OAuth won't work. The major use case for this is moving installs across domains.",
  "fa6f87ec37c06583": "Epoch timestamp.",
  "fb14a51b9ecff87a": "Expected Column Type",
  "fb45d5513ed72de2": "Enable developer mode",
  "fbd564c656cf5999": "Woe! This request had its journey cut short by unexpected circumstances (%s).",
  "fc1da67342b789a9": "Customizes retention policies for garbage collectors.",
  "fc33d7f17f54721d": "Configure SendGrid integration.",
  "fc54e181f8a629a4": "You can usually install a PHP extension using %s or %s. Common package names are %s or %s. Try commands like these:",
  "fc8463acedaff55b": "This schema can use a better column type.",
  "fc96bac63f108cfa": "The request date.",
  "fca6530e46013879": "Reply handlers can no longer be overridden with configuration.",
  "fd0c171d797b4b32": "Note that the default format is subject to change in the future, so if you rely on the log's format, specify it explicitly.",
  "fd6a4e02d96404ce": "This version of Phabricator does not support PHP 7. You are running PHP %s.",
  "fdcb8a4190e4a64a": "An input to the hash function when building resource hashes.",
  "fdcd53e301b4bf80": "MySQL is Using Default Minimum Word Length",
  "fe8544a51068ba95": "In places that we display a dropdown to syntax-highlight code, this is where that list is defined.",
  "fea8f719835620ec": "MySQL is Using the Default Boolean Syntax",
  "ffafc69b32338313": "Unignore",
  "ffc79a1b26cd0a64": "PHP setting \"%s\" should be set to \"-1\" to avoid deprecation warnings.",
  "ffe7186e725540d3": "Text values that match this regex and are also object names will not be linked.",
  "5227342670984464": "Write access log here."
}
