{
  "00d5d73d3809e925": "Learn how to configure mail and other options in Phabricator.",
  "04ed5a30ea0bcc04": "Create a Repository",
  "0efe2f85cd67c809": "If you are here for code review, let's set up your first repository.",
  "1e5fe3e3f95ec0bc": "You've configured at least one setting from the web interface.",
  "1eb484f4905c9e08": "Customize the default homepage layout and items.",
  "2705f94c32d8e8bc": "You've created at least one task.",
  "2912f9b92d7431d2": "Project tags define everything. Create them for teams, tags, or actual projects.",
  "38f627566dda6f37": "Explore Applications",
  "3da474537ac378c6": "Skip",
  "455083cac2ae96ea": "Quick Start",
  "46f41c5aad565112": "Configure account settings for all users, or just yourself",
  "515ad8ce9bb7eecf": "Change the name and add your company logo, just to give it a little extra polish.",
  "51d0e317b0f5ffa7": "Phabricator has been successfully installed. These next guides will take you through configuration and new user orientation. These steps are optional, and you can go through them in any order. If you want to get back to this guide later on, you can find it in {icon globe} **Applications** under {icon map-o} **Guides**.",
  "59fe7e60410f52d0": "You've set up a real-time notification server.",
  "5acfc0badb35c4e0": "You have some unresolved setup issues to take care of.",
  "5d859a72a65406e6": "Create some work for the interns in Maniphest.",
  "5fc6ab5d69b0c1e8": "If you're new to Phabricator, these optional steps can help you learn the basics. Conceptually, Phabricator is structured as a graph, and repositories, tasks, and projects are all independent from each other. Feel free to set up Phabricator for how you work best, and explore these features at your own pace.",
  "6bb896b77607ac76": "Your invitations have been accepted. You will not be alone on this journey.",
  "6fe26b1373ab767d": "You've configured at least one authentication provider.",
  "70e2bb263e7819dc": "You've created at least one dashboard.",
  "76018fc96e754bd4": "Short Tutorials",
  "7605c0e01f603842": "Invite the rest of your team to get started on Phabricator.",
  "768b4323e986bb51": "Phabricator can deliver notifications in real-time with WebSockets.",
  "7e11e4c66d7f235a": "You've created at least one repository.",
  "929a28d261428029": "Guides",
  "a1867bd6bfd5b2ad": "User Account Settings",
  "b325459bed359e6e": "Login and Registration",
  "b3bd51b127ff1311": "You've adjusted at least one setting on your account.",
  "b5a15bad1cc08996": "Personalize your Install",
  "b801b9ccdc229d9a": "Invite Collaborators",
  "c217cb0f9b995a3d": "You've created at least one project.",
  "ca5f965cff8f2b8d": "See all the applications included in Phabricator.",
  "ce728737a34c134f": "Build a Dashboard",
  "d4f61ec10f8563dc": "It looks amazing, good work. Home Sweet Home.",
  "d8d1d5a6042642e8": "Two guidance extensions generated guidance with the same key (\"$1\"). Each piece of guidance must have a unique key.",
  "e7643788502a37ce": "Notification Server",
  "ed39fa272e927a8d": "Authentication providers allow users to register accounts and log in to Phabricator.",
  "f023a66281396c8e": "Resolve Setup Issues",
  "f686d3a240c27c8c": "Install Phabricator",
  "fa9a5794e77589de": "You've resolved (or ignored) all outstanding setup issues."
}
